:PROPERTIES:
:ID:       3ba0230c-1885-4a6e-9e92-c82085f2f153
:END:
#+title: ENG331 - Control Systems 1
#+date: [2025-07-21 Mon 16:55]
#+AUTHOR: Baley Eccles - 652137
#+FILETAGS: :UTAS:2025:
#+STARTUP: latexpreview
#+LATEX_HEADER: \usepackage[a4paper, margin=2cm]{geometry}
#+LATEX_HEADER_EXTRA: \usepackage{minted}
#+LATEX_HEADER_EXTRA: \usepackage{fontspec}
#+LATEX_HEADER_EXTRA: \setmonofont{Iosevka}
#+LATEX_HEADER_EXTRA: \setminted{fontsize=\small, frame=single, breaklines=true}
#+LATEX_HEADER_EXTRA: \usemintedstyle{emacs}
#+LATEX_HEADER_EXTRA: \usepackage{float}
#+LATEX_HEADER_EXTRA: \setlength{\parindent}{0pt}

* Notes
 - [[id:1f70134e-cf99-4909-aa3e-0352f2d0d6d9][Modeling Systems]]
 - [[id:3759ca8f-4825-4407-a333-4aa30ec4136b][Frequency Response Tecniques]]
 - [[id:bcab7053-f2ea-4117-a8c8-eeea97587087][Root Locus]]
* Assessment


** Assessment Task 1: Assessed tutorials
 - 20%
 - Fortnightly
   
 - [[id:9e75c8a3-8958-4508-8652-9ce4c6f18115][ENG331 - Control Systems 1 - Assignment 1]]
 - [[id:96e084e6-aded-49b7-9522-3bdd9dd97344][ENG331 - Control Systems 1 - Assignment 2]]
 - [[id:862268d9-e7e1-4e3a-be45-5c027b31dd9b][ENG331 - Control Systems 1 - Assignment 3]]
 - [[id:3eb76f9d-5112-49a0-8b21-8976591d6fd6][ENG331 - Control Systems 1 - Assignment 4]]
   
** Assessment Task 2: Design report
 - 20%
 - Week 13
   - Work on for the second half of unit
 - 10 pages

** Assessment Task 3: Practical laboratory
 - 20%
 - Assessed during lab and report
 - Weeks 2 and 10
   
 - [[id:5002187a-38b3-4906-9fd1-d4a3d83864b3][ENG331 - Control Systems 1 - Lab 1]]
 - [[id:536ba461-384b-4879-9b5e-8155ff6cae59][ENG331 - Control Systems 1 - Lab 2]]
 - [[id:d7232721-a1e8-461a-a47d-7ce7b11134f0][ENG331 - Control Systems 1 - Lab 3]]

** Assessment Task 4: Final exam
 - 40%
#+BEGIN_SRC octave :exports code :results output :session Des1
clc
clear
close all

pkg load symbolic


syms s K

G_1 = (10*s + 30)/((s+4)*(5*s +3));
G_2 = (5*K*(s + 4))/(5*s^2 + 18*s + 9);
H = (5*s + 15)/(5*s^2 + 23*s + 12);

T = latex(simplify(G_1*G_2/(1 + G_2*H)))

w_n = sqrt((9 + 25*K)/25)

z = 30/(25*2*w_n)

vpa(solve(0.4 == exp(-z*pi/sqrt(1 - z^2))))

#+END_SRC

#+RESULTS:
#+begin_example
T = \frac{50 K}{25 K + 25 s^{2} + 30 s + 9}
w_n = (sym)

    __________
  ╲╱ K + 9/25
z = (sym)

        3       
  ──────────────
      __________
  5⋅╲╱ K + 9/25
warning: passing floating-point values to sym is dangerous, see "help sym"
warning: called from
    double_to_sym_heuristic at line 50 column 7
    sym at line 384 column 11
    eq at line 93 column 3

ans = (sym) 4.2319025516719106933673654428399
#+end_example
